### Step 1: imports

In [94]:
import pandas as pd
import plotly.express as px
import sqlalchemy
import numpy as np

### Step 1b: Import the Data

In [267]:
df = pd.read_csv(r'C:\Users\bioni\OneDrive\Documents\GitHub\Coding_Temple\Wk 6\Assignments\D2\Taylor_Train.csv', encoding="latin-1")
df.head()

,City,Country,Venue,Opening act(s),Attendance (tickets sold / available),Revenue,Tour
0,Evansville,United States,Roberts Municipal Stadium,Gloriana\r\nKellie Pickler,"7,463 / 7,463","$360,617",Fearless_Tour
1,Jonesboro,United States,Convocation Center,Gloriana\r\nKellie Pickler,"7,822 / 7,822","$340,328",Fearless_Tour
2,St. Louis,United States,Scottrade Center,Gloriana\r\nKellie Pickler,"13,764 / 13,764","$650,420",Fearless_Tour
3,Alexandria,United States,Bishop Ireton High School,Gloriana\r\nKellie Pickler,,,Fearless_Tour
4,North Charleston,United States,North Charleston Coliseum,Gloriana\r\nKellie Pickler,"8,751 / 8,751","$398,154",Fearless_Tour

### Step 2: Tidy the Data

In [268]:
df['Opening act(s)'] = df['Opening act(s)'].str.strip().str.replace('\r\n', ', ')
df['Opening act(s)']

0      Gloriana, Kellie Pickler
1      Gloriana, Kellie Pickler
2      Gloriana, Kellie Pickler
3      Gloriana, Kellie Pickler
4      Gloriana, Kellie Pickler
                 ...
440          Charli XCX, Broods
441          Charli XCX, Broods
442          Charli XCX, Broods
443                  Charli XCX
444                  Charli XCX
Name: Opening act(s), Length: 445, dtype: object

In [269]:
df[["tickets_sold", "tickets_available"]] = df["Attendance (tickets sold / available)"].str.split("/", expand = True)

df.head()

,City,Country,Venue,Opening act(s),Attendance (tickets sold / available),Revenue,Tour,tickets_sold,tickets_available
0,Evansville,United States,Roberts Municipal Stadium,"Gloriana, Kellie Pickler","7,463 / 7,463","$360,617",Fearless_Tour,"7,463","7,463"
1,Jonesboro,United States,Convocation Center,"Gloriana, Kellie Pickler","7,822 / 7,822","$340,328",Fearless_Tour,"7,822","7,822"
2,St. Louis,United States,Scottrade Center,"Gloriana, Kellie Pickler","13,764 / 13,764","$650,420",Fearless_Tour,"13,764","13,764"
3,Alexandria,United States,Bishop Ireton High School,"Gloriana, Kellie Pickler",,,Fearless_Tour,,None
4,North Charleston,United States,North Charleston Coliseum,"Gloriana, Kellie Pickler","8,751 / 8,751","$398,154",Fearless_Tour,"8,751","8,751"

In [270]:
df.drop("Attendance (tickets sold / available)",axis=1,inplace=True)

In [271]:
df.head()

,City,Country,Venue,Opening act(s),Revenue,Tour,tickets_sold,tickets_available
0,Evansville,United States,Roberts Municipal Stadium,"Gloriana, Kellie Pickler","$360,617",Fearless_Tour,"7,463","7,463"
1,Jonesboro,United States,Convocation Center,"Gloriana, Kellie Pickler","$340,328",Fearless_Tour,"7,822","7,822"
2,St. Louis,United States,Scottrade Center,"Gloriana, Kellie Pickler","$650,420",Fearless_Tour,"13,764","13,764"
3,Alexandria,United States,Bishop Ireton High School,"Gloriana, Kellie Pickler",,Fearless_Tour,,None
4,North Charleston,United States,North Charleston Coliseum,"Gloriana, Kellie Pickler","$398,154",Fearless_Tour,"8,751","8,751"

In [272]:
df.columns = df.columns.str.lower().str.strip().str.replace(' ', '_')
df.columns

Index(['city', 'country', 'venue', 'opening_act(s)', 'revenue', 'tour',
       'tickets_sold', 'tickets_available'],
      dtype='object')

In [254]:
#df['tickets_sold'].str.strip().str.replace(',', '')

In [273]:
df.head()

,city,country,venue,opening_act(s),revenue,tour,tickets_sold,tickets_available
0,Evansville,United States,Roberts Municipal Stadium,"Gloriana, Kellie Pickler","$360,617",Fearless_Tour,"7,463","7,463"
1,Jonesboro,United States,Convocation Center,"Gloriana, Kellie Pickler","$340,328",Fearless_Tour,"7,822","7,822"
2,St. Louis,United States,Scottrade Center,"Gloriana, Kellie Pickler","$650,420",Fearless_Tour,"13,764","13,764"
3,Alexandria,United States,Bishop Ireton High School,"Gloriana, Kellie Pickler",,Fearless_Tour,,None
4,North Charleston,United States,North Charleston Coliseum,"Gloriana, Kellie Pickler","$398,154",Fearless_Tour,"8,751","8,751"

In [274]:
df['tickets_sold'] = df['tickets_sold'].replace('\x97', '0').str.replace(',','').fillna(0).astype(int)

In [275]:
df['tickets_available'] = df['tickets_available'].replace('\x97', '0').str.replace(',','').fillna(0).astype(int)

In [285]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 445 entries, 0 to 444
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   city               445 non-null    object
 1   country            445 non-null    object
 2   venue              445 non-null    object
 3   opening_act(s)     445 non-null    object
 4   revenue            442 non-null    object
 5   tour               445 non-null    object
 6   tickets_sold       445 non-null    int32
 7   tickets_available  445 non-null    int32
dtypes: int32(2), object(6)
memory usage: 24.5+ KB

In [280]:
df['revenue']=df(['revenue'], errors='coerce').fillna(0, downcast='infer')

TypeError: 'DataFrame' object is not callable

In [277]:
df['opening_act(s)'] = df['opening_act(s)'].fillna(0)

In [290]:
df['revenue'] = df['revenue'].replace('\x97', '0').str.replace('$','').fillna(0).str.replace(",","").astype(float)

In [293]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 445 entries, 0 to 444
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   city               445 non-null    object
 1   country            445 non-null    object
 2   venue              445 non-null    object
 3   opening_act(s)     445 non-null    object
 4   revenue            445 non-null    float64
 5   tour               445 non-null    object
 6   tickets_sold       445 non-null    int32
 7   tickets_available  445 non-null    int32
dtypes: float64(1), int32(2), object(5)
memory usage: 24.5+ KB

In [292]:
df['revenue'] = df['revenue'].fillna(0)

In [294]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 445 entries, 0 to 444
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   city               445 non-null    object
 1   country            445 non-null    object
 2   venue              445 non-null    object
 3   opening_act(s)     445 non-null    object
 4   revenue            445 non-null    float64
 5   tour               445 non-null    object
 6   tickets_sold       445 non-null    int32
 7   tickets_available  445 non-null    int32
dtypes: float64(1), int32(2), object(5)
memory usage: 24.5+ KB

### Step 3: EDA (Exploratory Data Analysis)
We begin exploring and gathering summary statistics about our dataset and arm ourselves with as much knowledge as possible about what it is we are working with.

We also going to take the time in this section to see if there is any further tidying up that needs to be accomplished before we can begin moving forward.

- df.describe()
- df.info()
- df.value_count()

In [296]:
df.describe().round(2)

           revenue  tickets_sold  tickets_available
count       445.00        445.00             445.00
mean    3551228.93      35628.42           35671.58
std     4276179.72      35178.54           35165.02
min           0.00          0.00               0.00
25%      828231.00      12807.00           12807.00
50%     1864934.00      25991.00           25991.00
75%     4268678.00      49464.00           49464.00
max    22031386.00     174764.00          174764.00

In [297]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 445 entries, 0 to 444
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   city               445 non-null    object
 1   country            445 non-null    object
 2   venue              445 non-null    object
 3   opening_act(s)     445 non-null    object
 4   revenue            445 non-null    float64
 5   tour               445 non-null    object
 6   tickets_sold       445 non-null    int32
 7   tickets_available  445 non-null    int32
dtypes: float64(1), int32(2), object(5)
memory usage: 24.5+ KB

In [298]:
df.value_counts()

city         country        venue              opening_act(s)              revenue     tour                     tickets_sold  tickets_available
Los Angeles  United States  Staples Center     Vance Joy, Haim             8961681.0   The_1989_World_Tour      70563         70563                5
                                               Ed Sheeran, Casey James     4734463.0   The_Red_Tour             55829         55829                4
                                               Needtobreathe               3927154.0   Speak_Now_World_Tour     54900         54900                4
Newark       United States  Prudential Center  Needtobreathe               3875463.0   Speak_Now_World_Tour     51487         51487                4
Melbourne    Australia      AAMI Park          Vance Joy                   10421553.0  The_1989_World_Tour      98136         98136                3
                                                                                                                                                  ..
Houston      United States  Toyota Center      Ed Sheeran, Brett Eldredge  961422.0    The_Red_Tour             12467         12467                1
                            NRG Stadium        Camila Cabello, Charli XCX  9350275.0   Reputation_Stadium_Tour  53800         53800                1
                            Minute Maid Park   Vance Joy, Shawn Mendes     5202196.0   The_1989_World_Tour      40122         40122                1
                                               Needtobreathe               3435756.0   Speak_Now_World_Tour     42095         42095                1
Winnipeg     Canada         MTS Centre         Gloriana, Kellie Pickler    512487.0    Fearless_Tour            11369         11369                1
Name: count, Length: 333, dtype: int64

In [ ]:
df.to_csv('Tay_Tay.csv', index= False)